{
    "bookDatabase": [
        {
            "author": "Mary Shelley",
            "cover": "https://i.pinimg.com/originals/ed/4a/32/ed4a32a802e5400764167886665b8d8d.jpg",
            "description": "Mary Shelley started writing classic gothic thriller Frankenstein when she was 18 years old. Two centuries later, it is a major ancestor of both the science fiction and horror genres, tackling huge themes like the nature of life and death, immortality and genetic engineering.",
            "genre": "SCI-FI",
            "title": "Frankenstein",
            "year": 1990
        },
        {
            "author": "Michael Chrichton",
            "cover": "https://images-na.ssl-images-amazon.com/images/I/51L1V4DpHpL._SX278_BO1,204,203,200_.jpg",
            "description": "Before it mutated into the mega media franchise “Jurassic World”, Jurassic Park was a smart, thoughtful and gripping sci-fi classic written by Michael Crichton, author of the equally brilliant Andromeda Strain. Crichton's tale remains a great parable about the dangers of genetic engineering.",
            "genre": "SCI-FI",
            "title": "Jurassic Park",
            "year": 1818
        },
        {
            "author": "Isaac Asimov",
            "cover": "https://images-na.ssl-images-amazon.com/images/I/811zq%2B9%2BhNL.jpg",
            "description": "Asimov was a prolific writer, but many of his best works are classic short stories such as Nightfall, or The Last Question, which play out like long jokes with a punchline twist at the end.",
            "genre": "SCI-FI",
            "title": "Foundation",
            "year": 1951
        },
        {
            "author": "Frank Herbert",
            "cover": "https://images-na.ssl-images-amazon.com/images/I/81BJ3OD3J-L.jpg",
            "description": "In 2012, Wired US readers voted Dune the best science-fiction novel of all time. It’s also the best-selling of all time, and has inspired a mammoth universe, including 18 books set over 34,000 years and a terrible 1984 movie adaptation by David Lynch, his worst film by far.",
            "genre": "SCI-FI",
            "title": "Dune",
            "year": 1965
        },
        {
            "author": "George R.R. Martin",
            "cover": "https://upload.wikimedia.org/wikipedia/en/d/dc/A_Song_of_Ice_and_Fire_book_collection_box_set_cover.jpg",
            "description": "Fans of the television series have been distancing themselves from Game of Thrones in droves since that disastrous final season, but George R.R. Martin's books remain relatively untainted.",
            "genre": "FANTASY",
            "title": "A Song of Ice and Fire",
            "year": 1996
        },
        {
            "author": "Terry Pratchett and Neil Gaiman",
            "cover": "https://images-na.ssl-images-amazon.com/images/I/8167H8DUjnL.jpg",
            "description": "Both Pratchett and Gaiman feature in their own right on this list and Good Omens, composed in part over answerphone messages three decades ago, delivers on the promise of a fantasy literature titan team up.",
            "genre": "FANTASY",
            "title": "Good Omens",
            "year": 1990
        },
        {
            "author": "Neil Gaiman",
            "cover": "https://i.harperapps.com/covers/9780062896261/y648.jpg",
            "description": "The Amazon Prime series failed to spark, but Neil Gaiman's richly described novel is well worth a read. American Gods pits the abandoned folk deities of the old world against the modern idols we worship now.",
            "genre": "FANTASY",
            "title": "American Gods",
            "year": 2001
        },
        {
            "author": "Gillian Flynn",
            "cover": "https://s26162.pcdn.co/wp-content/uploads/sites/3/2019/11/gone-girl-large.jpg",
            "description": "More than any other book in the decade, Gillian Flynn’s mega-hit Gone Girl captured the essence of female rage, as millions of well-dressed, seemingly content women used Flynn’s fearsome takedown of the patriarchy to unleash their inner discontent.",
            "genre": "CRIME",
            "title": "Gone Girl",
            "year": 2012
        },
        {
            "author": "Patrick Hoffman",
            "cover": "https://s26162.pcdn.co/wp-content/uploads/sites/3/2019/11/every-man-a-menace.jpg",
            "description": "When Hoffman’s second novel was released in 2016, a good deal of attention was given to the author’s continued work as a private investigator. But if you came to his fiction expecting a formulaic detective story, you’d be drastically mistaken.",
            "genre": "CRIME",
            "title": "Every Man a Menace",
            "year": 2012
        },
        {
            "author": "Shirley Jackson",
            "cover": "https://images.penguinrandomhouse.com/cover/9780143129370",
            "description": "These are the legendary opening words of The Haunting of Hill House, our pick for the best—and best-written—horror novel of all time. Shirley Jackson’s chilling, lean haunted house tale follows Eleanor Vance, a young woman with a bit of a sensitivity for the paranormal.",
            "genre": "HORROR",
            "title": "The Haunting of Hill House",
            "year": 1959
        }
    ]
}
